# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

print('Эта программа проверяет, является ли день недели выходным')
print('Введите число, обозначающее день недели:')

day = int(input())

if day == 6 :
    print('да')
elif day == 7 :
    print('да')
else:
    print('нет')

